results/consumer-slice/consumer-security-slice-tls-broker5/consumer-security-slice-tls-b5-rf3-isr3-msg102400-tps1000-batch16384-acksall-prod1-cons6-complz4-trial3/producer-seed.log
1599 records sent, 319.8 records/sec (31.23 MB/sec), 512.5 ms avg latency, 1448.0 ms max latency.
3795 records sent, 759.0 records/sec (74.12 MB/sec), 10.2 ms avg latency, 75.0 ms max latency.
4298 records sent, 859.6 records/sec (83.95 MB/sec), 9.1 ms avg latency, 53.0 ms max latency.
4317 records sent, 863.4 records/sec (84.32 MB/sec), 8.5 ms avg latency, 58.0 ms max latency.
4411 records sent, 882.2 records/sec (86.15 MB/sec), 7.3 ms avg latency, 49.0 ms max latency.
5766 records sent, 1153.2 records/sec (112.62 MB/sec), 8.8 ms avg latency, 59.0 ms max latency.
6018 records sent, 1203.6 records/sec (117.54 MB/sec), 9.8 ms avg latency, 86.0 ms max latency.
6104 records sent, 1220.6 records/sec (119.19 MB/sec), 9.4 ms avg latency, 63.0 ms max latency.
6180 records sent, 1235.8 records/sec (120.68 MB/sec), 8.8 ms avg latency, 95.0 ms max latency.
6144 records sent, 1228.8 records/sec (120.00 MB/sec), 8.7 ms avg latency, 68.0 ms max latency.
6112 records sent, 1222.4 records/sec (119.38 MB/sec), 9.8 ms avg latency, 62.0 ms max latency.
5278 records sent, 1055.6 records/sec (103.09 MB/sec), 8.2 ms avg latency, 65.0 ms max latency.
4987 records sent, 997.2 records/sec (97.38 MB/sec), 37.1 ms avg latency, 376.0 ms max latency.
4838 records sent, 967.2 records/sec (94.45 MB/sec), 14.2 ms avg latency, 137.0 ms max latency.
5185 records sent, 1037.0 records/sec (101.27 MB/sec), 11.1 ms avg latency, 70.0 ms max latency.
4987 records sent, 997.4 records/sec (97.40 MB/sec), 8.7 ms avg latency, 52.0 ms max latency.
5017 records sent, 1003.4 records/sec (97.99 MB/sec), 7.0 ms avg latency, 49.0 ms max latency.
4998 records sent, 999.2 records/sec (97.58 MB/sec), 7.1 ms avg latency, 46.0 ms max latency.
5004 records sent, 1000.6 records/sec (97.71 MB/sec), 7.4 ms avg latency, 54.0 ms max latency.
100000 records sent, 999.700090 records/sec (97.63 MB/sec), 18.41 ms avg latency, 1448.00 ms max latency, 6 ms 50th, 32 ms 95th, 318 ms 99th, 1151 ms 99.9th.